package test.java.InterfaceTest.TextDNN;
import P_V.PEQ.AMV.ECS.test.ANNTest;
import S_A.SVQ.stable.S_String;
import org.junit.jupiter.api.Test;
import test.java.InterfaceTest.CommonTestInition;

/*
 * 著作权人, 作者 罗瑶光, 浏阳
 * yaoguangluo@outlook.com, 313699483@qq.com, 2080315360@qq.com, 
 * (lyg.tin@gmail.com2018年回国后因国内G网屏蔽不再使用）
 * 15116110525-
 * 430181198505250014, G24402609, EB0581342
 * 204925063, 389418686, F2406501, 0626136
 * 湖南省 浏阳市 集里街道 神仙坳社区 大塘冲一段路 208号 阳光家园别墅小区 第十栋别墅
 * */
class ANNTestTest {
    /*
     * 这是一个 用于文本的pos频率词汇比重ANN计算文本价值的德塔图灵分词个人著作权中的权重内核的核心模块计算
     * 测试main函数demo的test版本，在导入了api之后进行系统集成，然后
     * 用下面的对应的函数中源码逻辑进行复制粘贴到工程中，直接运行，即可出结果，源码的逻辑按照输入准备计算的参数，
     * 然后执行，然后获取输出需要的结果，可以用断点来查看数据，也可以用println来显示输出，方便集成，对程序员友好。
     * 系统需要jdk1.8 以上的java环境，本人会把测试的输入输出都注释在这个文件里。及其傻瓜化的流程，方便商业化落地。
     * --罗瑶光
     * */
    @Test
    void main() {
        //环境初始化。
        CommonTestInition commonTestInition = new CommonTestInition();
        commonTestInition.initEnvironment("去弹窗组件流测试");
        //
        ANNTest aNNTest = new ANNTest();
        //exec
        String[][] annMatrix = aNNTest.getANNMatrix(S_String.text1, commonTestInition.NE);
        //小心jdk版本不同导致各种double nan问题，矩阵的xy对应长和宽问题，
        for (int j = 0; j < annMatrix.length; j++) {
            double sum = 0.0;
            for (int i = 7; i < annMatrix[0].length; i++) {
                Double temp = Double.valueOf(annMatrix[j][i]);
                if (temp.isNaN()) {
                    temp = 0.0;
                }
                sum += temp.doubleValue();
            }
            System.out.println(annMatrix[j][0] + "-" + annMatrix[j][1]
                + "-" + annMatrix[j][2] + "-" + annMatrix[j][3] + "-ANN:" + sum);
        }
        //output

        //end
        commonTestInition.endEnvironment();
    }
/* 输出
* Connected to the target VM, address: '127.0.0.1:54003', transport: 'socket'
trif
隐患-危险-语料库空-语料库空-ANN:0.025161892794336175
闭塞-语料库空-自闭-防御-ANN:0.025161892794336175
提高-语料库空-语料库空-语料库空-ANN:0.025161892794336175
物体-语料库空-语料库空-语料库空-ANN:0.025161892794336175
选择-语料库空-语料库空-语料库空-ANN:0.07826653813961781
友善-语料库空-善良-合作-ANN:0.056184192706339196
推论-语料库空-语料库空-语料库空-ANN:0.025161892794336175
达到-语料库空-语料库空-语料库空-ANN:0.025161892794336175
欲望-警惕-语料库空-语料库空-ANN:0.043020736486545225
生物-语料库空-语料库空-语料库空-ANN:0.025161892794336175
自信-语料库空-语料库空-语料库空-ANN:0.056184192706339196
减少-语料库空-语料库空-语料库空-ANN:0.025161892794336175
价值-利益-语料库空-语料库空-ANN:0.056184192706339196
空虚-语料库空-语料库空-语料库空-ANN:0.056184192706339196
能力-语料库空-语料库空-语料库空-ANN:0.025161892794336175
充满-语料库空-语料库空-语料库空-ANN:0.025161892794336175
强制-语料库空-语料库空-语料库空-ANN:0.025161892794336175
危害性-语料库空-语料库空-语料库空-ANN:0.043020736486545225
因素-语料库空-语料库空-语料库空-ANN:0.043020736486545225
大于-语料库空-语料库空-语料库空-ANN:0.043020736486545225
观察-了解-语料库空-语料库空-ANN:0.025161892794336175
产生-语料库空-语料库空-语料库空-ANN:0.043020736486545225
有效-语料库空-语料库空-语料库空-ANN:0.1521788428596197
依赖-贪婪-语料库空-语料库空-ANN:0.13869135078959932
受体-语料库空-语料库空-语料库空-ANN:0.043020736486545225
干涉-语料库空-语料库空-语料库空-ANN:0.025161892794336175
排斥-远离-语料库空-语料库空-ANN:0.043020736486545225
传授-教育-语料库空-语料库空-ANN:0.025161892794336175
危害-语料库空-语料库空-语料库空-ANN:0.025161892794336175
级别-语料库空-语料库空-语料库空-ANN:0.025161892794336175
中间-语料库空-语料库空-语料库空-ANN:0.025161892794336175
精神-语料库空-语料库空-语料库空-ANN:0.07826653813961781
分享-帮助-语料库空-语料库空-ANN:0.025161892794336175
导致-语料库空-语料库空-语料库空-ANN:0.07826653813961781
相关-语料库空-语料库空-语料库空-ANN:0.056184192706339196
教育-纠正-语料库空-语料库空-ANN:0.056184192706339196
具有-语料库空-语料库空-语料库空-ANN:0.025161892794336175
方式-语料库空-语料库空-语料库空-ANN:0.07826653813961781
思维-语料库空-语料库空-语料库空-ANN:0.025161892794336175
其中-语料库空-语料库空-语料库空-ANN:0.07826653813961781
上瘾-语料库空-语料库空-语料库空-ANN:0.07826653813961781
行为-语料库空-语料库空-语料库空-ANN:0.025161892794336175
医学-语料库空-语料库空-语料库空-ANN:0.043020736486545225
完美-语料库空-语料库空-语料库空-ANN:0.056184192706339196
引导-语料库空-语料库空-语料库空-ANN:0.07826653813961781
豁达-语料库空-语料库空-语料库空-ANN:0.025161892794336175
贬义-语料库空-语料库空-语料库空-ANN:0.3293278619702663
长期-语料库空-语料库空-语料库空-ANN:0.07826653813961781
需要-需求-语料库空-合作-ANN:0.043020736486545225
感染-英雄-语料库空-语料库空-ANN:0.025161892794336175
倾向-语料库空-自恋-语料库空-ANN:0.025161892794336175
美好-语料库空-语料库空-语料库空-ANN:0.1521788428596197
不稳定-语料库空-语料库空-语料库空-ANN:0.025161892794336175
应激-语料库空-语料库空-语料库空-ANN:0.025161892794336175
严谨-疑虑-语料库空-语料库空-ANN:0.056184192706339196
愉悦-语料库空-语料库空-语料库空-ANN:0.056184192706339196
时间-语料库空-语料库空-语料库空-ANN:0.025161892794336175
改变-进步-逆商-语料库空-ANN:0.42672045348580473
环境-语料库空-语料库空-语料库空-ANN:0.4247205336760356
周期-语料库空-语料库空-语料库空-ANN:0.025161892794336175
进行-语料库空-语料库空-语料库空-ANN:0.025161892794336175
最重要-语料库空-语料库空-语料库空-ANN:0.056184192706339196
强烈-语料库空-语料库空-语料库空-ANN:0.056184192706339196
剂量-语料库空-语料库空-语料库空-ANN:0.025161892794336175
成瘾性-语料库空-语料库空-语料库空-ANN:0.025161892794336175
替代-语料库空-语料库空-语料库空-ANN:0.07826653813961781
药物-语料库空-语料库空-语料库空-ANN:0.025161892794336175
误差-思想-语料库空-语料库空-ANN:0.043020736486545225
戒断-语料库空-语料库空-语料库空-ANN:0.043020736486545225
造成-语料库空-语料库空-语料库空-ANN:0.025161892794336175
丧失-语料库空-语料库空-语料库空-ANN:0.025161892794336175
定义-语料库空-语料库空-语料库空-ANN:0.043020736486545225
接触-了解-语料库空-语料库空-ANN:0.025161892794336175
物, -语料库空-语料库空-语料库空-ANN:0.025161892794336175
时候-语料库空-语料库空-语料库空-ANN:0.07826653813961781
免疫-语料库空-语料库空-语料库空-ANN:0.056184192706339196
健康-语料库空-优秀-示威-ANN:0.043020736486545225
属于-语料库空-语料库空-语料库空-ANN:0.025161892794336175
强迫-语料库空-语料库空-语料库空-ANN:0.3293278619702663
Disconnected from the target VM, address: '127.0.0.1:54003', transport: 'socket'

Process finished with exit code 0
* */


    @Test
    void getANNMatrix() {
    }

    @Test
    void getPOSPCAAnnMatrix() {
    }

    @Test
    void testGetANNMatrix() {
    }
}