package test.java.InterfaceTest.TextDNN;

import M_V.MSV.OSQ.sets.DetaDouble;
import P_V.PEQ.AMV.ECS.test.ANNTest;
import P_V.PEQ.AMV.ECS.test.DNNTest;
import S_A.SVQ.stable.S_String;
import org.junit.jupiter.api.Test;
import test.java.InterfaceTest.CommonTestInition;

/*
 * 著作权人, 作者 罗瑶光, 浏阳
 * yaoguangluo@outlook.com, 313699483@qq.com, 2080315360@qq.com,
 * (lyg.tin@gmail.com2018年回国后因国内G网屏蔽不再使用）
 * 15116110525-
 * 430181198505250014, G24402609, EB0581342
 * 204925063, 389418686, F2406501, 0626136
 * 湖南省 浏阳市 集里街道 神仙坳社区 大塘冲一段路 208号 阳光家园别墅小区 第十栋别墅
 * */
class DNNTestTest {
    /*
     * 这是一个 用于文本的深度词汇比重计算文本重心的德塔图灵分词个人著作权中的权重内核的核心模块计算 测试main函数demo的test版本，在导入了api之后进行系统集成，然后
     * 用下面的对应的函数中源码逻辑进行复制粘贴到工程中，直接运行，即可出结果，源码的逻辑按照输入准备计算的参数，
     * 然后执行，然后获取输出需要的结果，可以用断点来查看数据，也可以用println来显示输出，方便集成，对程序员友好。
     * 系统需要jdk1.8 以上的java环境，本人会把测试的输入输出都注释在这个文件里。及其傻瓜化的流程，方便商业化落地。
     * --罗瑶光
     * */
    @Test
    void main() {
        //环境初始化。
        CommonTestInition commonTestInition = new CommonTestInition();
        commonTestInition.initEnvironment("去弹窗组件流测试");
        //exec
        DNNTest dNNTest = new DNNTest();
        ANNTest aNNTest = new ANNTest();
        String[][] ann = aNNTest.getANNMatrix(S_String.text1, commonTestInition.NE);
        String[][] dnn = dNNTest.getDNNMatrix(ann, S_String.text1, commonTestInition.NE);
        for (int i = 0; i < dnn.length; i++) {
            double dnn_lwa = DetaDouble.parseDouble(dnn[i][3]);
            System.out.print(ann[i][0] + ":");
            System.out.print(ann[i][1] + ":");
            System.out.print(ann[i][2] + ":");
            System.out.print(ann[i][3] + ":");
            System.out.print(dnn[i][0] + ":");
            System.out.print(dnn[i][3] + ":");
            System.out.println("");
        }
        //output

        //end
        commonTestInition.NE.stop();
        commonTestInition.endEnvironment();
    }
/*  输出
* Connected to the target VM, address: '127.0.0.1:54005', transport: 'socket'
Connected to the target VM, address: '127.0.0.1:54011', transport: 'socket'
trif
隐患:危险:语料库空:语料库空:隐患:7.3636656248684655:
闭塞:语料库空:自闭:防御:闭塞:8.50723479246563:
提高:语料库空:语料库空:语料库空:提高:5.732094510363332:
物体:语料库空:语料库空:语料库空:物体:4.839628550298749:
选择:语料库空:语料库空:语料库空:选择:52.36686897056637:
友善:语料库空:善良:合作:友善:14.244290610297766:
推论:语料库空:语料库空:语料库空:推论:5.0468646057544655:
达到:语料库空:语料库空:语料库空:达到:5.217677556847627:
欲望:警惕:语料库空:语料库空:欲望:21.586123258287536:
生物:语料库空:语料库空:语料库空:生物:7.99506054681011:
自信:语料库空:语料库空:语料库空:自信:25.462725383018288:
减少:语料库空:语料库空:语料库空:减少:4.844808963736076:
价值:利益:语料库空:语料库空:价值:24.243452727878587:
空虚:语料库空:语料库空:语料库空:空虚:16.755583286997847:
能力:语料库空:语料库空:语料库空:能力:11.944015710875336:
充满:语料库空:语料库空:语料库空:充满:7.228789537127113:
强制:语料库空:语料库空:语料库空:强制:6.47845101664246:
危害性:语料库空:语料库空:语料库空:危害性:12.240363412762505:
因素:语料库空:语料库空:语料库空:因素:21.419660824446883:
大于:语料库空:语料库空:语料库空:大于:18.417315160522683:
观察:了解:语料库空:语料库空:观察:5.260467102521766:
产生:语料库空:语料库空:语料库空:产生:14.693361344466924:
有效:语料库空:语料库空:语料库空:有效:45.26171437357839:
依赖:贪婪:语料库空:语料库空:依赖:51.68676654707465:
受体:语料库空:语料库空:语料库空:受体:28.19534068439894:
干涉:语料库空:语料库空:语料库空:干涉:8.454125909261567:
排斥:远离:语料库空:语料库空:排斥:18.319555384430142:
传授:教育:语料库空:语料库空:传授:5.6338998973440235:
危害:语料库空:语料库空:语料库空:危害:6.298652592287492:
级别:语料库空:语料库空:语料库空:级别:8.76521723985495:
中间:语料库空:语料库空:语料库空:中间:7.0061143742658:
精神:语料库空:语料库空:语料库空:精神:51.715558731908914:
分享:帮助:语料库空:语料库空:分享:8.146285793261757:
导致:语料库空:语料库空:语料库空:导致:31.269301612527464:
相关:语料库空:语料库空:语料库空:相关:11.685187066189018:
教育:纠正:语料库空:语料库空:教育:15.139478777245792:
具有:语料库空:语料库空:语料库空:具有:1.9306649391523576:
方式:语料库空:语料库空:语料库空:方式:32.642645082303254:
思维:语料库空:语料库空:语料库空:思维:11.765354438779626:
其中:语料库空:语料库空:语料库空:其中:50.99930218292216:
上瘾:语料库空:语料库空:语料库空:上瘾:35.38047066511879:
行为:语料库空:语料库空:语料库空:行为:2.725298613499897:
医学:语料库空:语料库空:语料库空:医学:15.731592972691514:
完美:语料库空:语料库空:语料库空:完美:17.90013120306512:
引导:语料库空:语料库空:语料库空:引导:39.463622943604264:
豁达:语料库空:语料库空:语料库空:豁达:8.093733822638429:
贬义:语料库空:语料库空:语料库空:贬义:98.99653600891502:
长期:语料库空:语料库空:语料库空:长期:41.087176421879285:
需要:需求:语料库空:合作:需要:24.62793247324495:
感染:英雄:语料库空:语料库空:感染:7.988688344189201:
倾向:语料库空:自恋:语料库空:倾向:11.286040079843387:
美好:语料库空:语料库空:语料库空:美好:66.13227600719317:
不稳定:语料库空:语料库空:语料库空:不稳定:9.847146925229229:
应激:语料库空:语料库空:语料库空:应激:6.046541903579101:
严谨:疑虑:语料库空:语料库空:严谨:13.08164588780074:
愉悦:语料库空:语料库空:语料库空:愉悦:13.847507044686493:
时间:语料库空:语料库空:语料库空:时间:6.852376281310397:
改变:进步:逆商:语料库空:改变:294.0248704357794:
环境:语料库空:语料库空:语料库空:环境:781.2614874060907:
周期:语料库空:语料库空:语料库空:周期:4.643272675876734:
进行:语料库空:语料库空:语料库空:进行:7.873360046588544:
最重要:语料库空:语料库空:语料库空:最重要:5.051672807294204:
强烈:语料库空:语料库空:语料库空:强烈:8.949866821491751:
剂量:语料库空:语料库空:语料库空:剂量:6.585924635796827:
成瘾性:语料库空:语料库空:语料库空:成瘾性:1.4875437233578022:
替代:语料库空:语料库空:语料库空:替代:28.176009235612575:
药物:语料库空:语料库空:语料库空:药物:10.84394490540525:
误差:思想:语料库空:语料库空:误差:28.822893692343253:
戒断:语料库空:语料库空:语料库空:戒断:12.031278522414983:
造成:语料库空:语料库空:语料库空:造成:6.437758787550178:
丧失:语料库空:语料库空:语料库空:丧失:3.3537581264148244:
定义:语料库空:语料库空:语料库空:定义:10.208425727796534:
接触:了解:语料库空:语料库空:接触:7.528572689237553:
物, :语料库空:语料库空:语料库空:物, :8.294455272714021:
时候:语料库空:语料库空:语料库空:时候:66.39392927820761:
免疫:语料库空:语料库空:语料库空:免疫:9.90744503552726:
健康:语料库空:优秀:示威:健康:21.812709020378854:
属于:语料库空:语料库空:语料库空:属于:5.487480827168625:
强迫:语料库空:语料库空:语料库空:强迫:98.2593616682648:
Disconnected from the target VM, address: '127.0.0.1:54011', transport: 'socket'

Process finished with exit code 0
* */
    @Test
    void getDNNMatrix() {
    }

    @Test
    void getDNNMatrixWithoutRnn() {
    }

    @Test
    void testGetDNNMatrix() {
    }
}