package test.java.InterfaceTest.TextDNN;

import P_V.PEQ.AMV.ECS.test.RNN_IDETest;
import S_A.SVQ.stable.S_String;
import org.junit.jupiter.api.Test;
import test.java.InterfaceTest.CommonTestInition;

/*
 * 著作权人, 作者 罗瑶光, 浏阳
 * yaoguangluo@outlook.com, 313699483@qq.com, 2080315360@qq.com,
 * (lyg.tin@gmail.com2018年回国后因国内G网屏蔽不再使用）
 * 15116110525-
 * 430181198505250014, G24402609, EB0581342
 * 204925063, 389418686, F2406501, 0626136
 * 湖南省 浏阳市 集里街道 神仙坳社区 大塘冲一段路 208号 阳光家园别墅小区 第十栋别墅
 * */
class RNN_IDETestTest {
    /*
     * 这是一个 德塔罗氏深度计算个人著作权中的RNN距离中心权重内核模块计算 测试main函数demo的test版本，
     * 在导入了api之后进行系统集成，然后
     * 用下面的对应的函数中源码逻辑进行复制粘贴到工程中，直接运行，即可出结果，源码的逻辑按照输入准备计算的参数，
     * 然后执行，然后获取输出需要的结果，可以用断点来查看数据，也可以用println来显示输出，方便集成，对程序员友好。
     * 系统需要jdk1.8 以上的java环境，本人会把测试的输入输出都注释在这个文件里。及其傻瓜化的流程，方便商业化落地。
     * --罗瑶光
     * */
    @Test
    void main() {
        //环境初始化。
        CommonTestInition commonTestInition = new CommonTestInition();
        commonTestInition.initEnvironment("去弹窗组件流测试");
        //exec
        RNN_IDETest rNN_IDETest = new RNN_IDETest();
        String[][] strings = rNN_IDETest.getIDEMatrix(S_String.text1, commonTestInition.NE);
        //output
        for (int i = 0; i < strings.length; i++) {
            for (int j = 0; j < strings[0].length; j++) {
                System.out.print("-" + strings[i][j]);
            }
            System.out.println("-");
        }
        //end
        commonTestInition.endEnvironment();
    }
/* 输出观测
* Connected to the target VM, address: '127.0.0.1:54366', transport: 'socket'
trif
-词名-pos距离-covex距离-euclid距离-
-隐患-4.0-409.0-139.0-
-这里-0.0-569.5-192.5-
-闭塞-16.0-557.5-188.5-
-提高-16.0-254.5-87.5-
-物体-4.0-97.0-35.0-
-选择-16.0-3015.0-734.75-
-逐渐-0.0-82.0-30.0-
-自身-0.0-76.0-28.0-
-友善-2.0-520.0-176.0-
-那么-0.0-1771.75-514.5-
-就是-0.0-377.5-128.5-
-推论-4.0-109.0-39.0-
-群体-0.0-713.0-211.75-
-一个-0.0-2872.8571428571427-605.625-
-达到-16.0-205.0-71.0-
-欲望-4.0-775.75-231.75-
-生物-4.0-278.5-95.5-
-自信-4.0-514.0-174.0-
-减少-16.0-181.0-63.0-
-价值-4.0-506.5-171.5-
-等等-0.0-1562.75-455.5-
-空虚-0.0-563.5-190.5-
-能力-4.0-619.0-209.0-
-充满-16.0-406.0-138.0-
-强制-4.0-179.5-62.5-
-危害性-4.0-331.0-75.0-
-疏导-0.0-479.5-162.5-
-因素-4.0-1134.5-228.25-
-大于-16.0-1020.75-303.5-
-观察-16.0-218.5-75.5-
-因为-0.0-1124.5-230.25-
-产生-16.0-863.0-192.25-
-如果-0.0-635.5-214.5-
-有效-0.0-802.0-189.75-
-依赖-16.0-1594.0-230.1875-
-小于-0.0-170.5-59.5-
-受体-4.0-1415.5-396.75-
-自己-16.0-463.0-157.0-
-干涉-4.0-317.5-108.5-
-排斥-16.0-1160.0-298.75-
-这个-4.0-880.25-198.25-
-传授-16.0-250.0-86.0-
-分段-0.0-350.5-119.5-
-心里-0.0-478.0-162.0-
-危害-4.0-167.5-58.5-
-级别-4.0-328.0-112.0-
-中间-4.0-209.5-72.5-
-反应-0.0-214.0-74.0-
-精神-4.0-2203.5714285714284-401.25-
-分享-16.0-523.0-177.0-
-很容易-0.0-488.5-165.5-
-关于-0.0-85.0-20.25-
-导致-16.0-1716.857142857143-264.0-
-相关-2.0-338.5-115.5-
-教育-4.0-196.0-68.0-
-自我-0.0-476.5-161.5-
-具有-16.0-23.5-10.5-
-方式-4.0-921.0-159.625-
-进行教育-0.0-247.0-85.0-
-思维-4.0-599.5-202.5-
-其中-4.0-2079.4285714285716-391.875-
-上瘾-16.0-1953.2857142857142-340.125-
-行为-4.0-37.0-15.0-
-医学-4.0-627.75-122.75-
-重要的-0.0-1817.25-528.5-
-没有-0.0-229.0-79.0-
-非常-4.0-3537.714285714286-906.375-
-完美-0.0-641.5-216.5-
-不可-0.0-100.0-36.0-
-引导-16.0-2171.8571428571427-419.75-
-豁达-16.0-517.0-175.0-
-贬义-0.0-572.5-193.5-
-只是-0.0-575.5-194.5-
-长期-4.0-1663.2857142857142-255.125-
-一些-0.0-1629.5-470.5-
-普遍-0.0-1013.0-193.75-
-需要-20.0-1058.5-265.5-
-生活方式-0.0-5506.272727272727-1194.375-
-感染-20.0-244.0-84.0-
-很多-0.0-1749.4285714285713-341.25-
-倾向-4.0-548.5-185.5-
-戒除-0.0-1395.142857142857-238.0-
-美好-0.0-1487.75-402.25-
-原物-0.0-172.0-60.0-
-但是-0.0-166.0-58.0-
-不稳定-4.0-428.5-145.5-
-应激-16.0-281.5-96.5-
-严谨-0.0-340.0-116.0-
-所以-0.0-604.0-204.0-
-而是-0.0-622.0-210.0-
-愉悦-2.0-469.0-159.0-
-时间-4.0-202.0-70.0-
-改变-16.0-3055.714285714286-779.625-
-也是-0.0-151.0-53.0-
-环境-4.0-19801.909090909092-3112.53125-
-周期-4.0-203.5-70.5-
-极易-0.0-433.0-147.0-
-进行-16.0-475.0-161.0-
-最重要-2.0-61.0-23.0-
-一种-0.0-594.0-119.0-
-强烈-0.0-154.0-54.0-
-剂量-4.0-182.5-63.5-
-成瘾性-4.0-4.0-4.0-
-替代-16.0-869.0-212.625-
-药物-4.0-511.0-173.0-
-不是-0.0-20299.68181818182-2981.125-
-溯源-0.0-52.0-20.0-
-误差-4.0-1519.5-413.75-
-戒断-16.0-505.75-133.5-
-可以-0.0-112.0-40.0-
-造成-16.0-319.0-109.0-
-初步-0.0-113.5-40.5-
-丧失-16.0-83.5-30.5-
-定义-4.0-230.75-52.0-
-接触-16.0-434.5-147.5-
-物, -4.0-296.5-101.5-
-时候-4.0-2500.1428571428573-661.125-
-某种-0.0-1078.5-224.75-
-本身-0.0-149.5-52.5-
-这些-0.0-497.5-168.5-
-免疫-2.0-259.0-89.0-
-我们-0.0-458.5-155.5-
-健康-4.0-1223.25-236.75-
-无法-0.0-451.0-153.0-
-属于-16.0-235.0-81.0-
-强迫-0.0-560.5-189.5-
-通过-0.0-994.8571428571429-238.5-
Disconnected from the target VM, address: '127.0.0.1:54455', transport: 'socket'

Process finished with exit code 0
* */
    @Test
    void getIDEMatrix() {
    }

    @Test
    void testGetIDEMatrix() {
    }

    @Test
    void getIDEMatrixExclude_A() {
    }

    @Test
    void testGetIDEMatrixExclude_A() {
    }
}